hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
/**
 *******************************************************************************
 * @file  hc32f120_rtc.c
 * @brief This file provides firmware functions to manage the Real-Time
 *        Clock(RTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-03-06       Yangjp          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f120_rtc.h"
#include "hc32f120_utility.h"

/**
 * @addtogroup HC32F120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_RTC RTC
 * @brief Real-Time Clock Driver Library
 * @{
 */

#if (DDL_RTC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup RTC_Local_Macros RTC Local Macros
 * @{
 */

/**
 * @defgroup RTC_Check_Parameters_Validity RTC Check Parameters Validity
 * @{
 */
#define IS_RTC_PERIOD_INTERRUPT(x)                                             \
(   (RTC_PERIOD_INT_INVALID == (x))             ||                             \
    (RTC_PERIOD_INT_HALF_SECOND == (x))         ||                             \
    (RTC_PERIOD_INT_ONE_SECOND == (x))          ||                             \
    (RTC_PERIOD_INT_ONE_MINUTE == (x))          ||                             \
    (RTC_PERIOD_INT_ONE_HOUR == (x))            ||                             \
    (RTC_PERIOD_INT_ONE_DAY == (x))             ||                             \
    (RTC_PERIOD_INT_ONE_MONTH == (x)))

#define IS_RTC_HOUR_FORMAT(x)                                                  \
(   (RTC_HOUR_FORMAT_12 == (x))                 ||                             \
    (RTC_HOUR_FORMAT_24 == (x)))

#define IS_RTC_WORK_MODE(x)                                                    \
(   (RTC_WORK_MODE_COUNT == (x))                ||                             \
    (RTC_WORK_MODE_WRITE_OR_READ == (x)))

#define IS_RTC_CLOCK_SOURCE(x)                                                 \
(   (RTC_CLOCK_SOURCE_XTAL32 == (x))            ||                             \
    (RTC_CLOCK_SOURCE_LRC == (x)))

#define IS_RTC_DATA_FORMAT(x)                                                  \
(   (RTC_DATA_FORMAT_DEC == (x))                ||                             \
    (RTC_DATA_FORMAT_BCD == (x)))

#define IS_RTC_HOUR12_AM_PM(x)                                                 \
(   (RTC_HOUR12_AM == (x))                      ||                             \
    (RTC_HOUR12_PM == (x)))

#define IS_RTC_YEAR(x)                          ((x) <= 99u)

#define IS_RTC_MONTH(x)                         (((x) >= 1u) && ((x) <= 12u))

#define IS_RTC_DAY(x)                           (((x) >= 1u) && ((x) <= 31u))

#define IS_RTC_HOUR12(x)                        (((x) >= 1u) && ((x) <= 12u))

#define IS_RTC_HOUR24(x)                        ((x) <= 23u)

#define IS_RTC_MINUTE(x)                        ((x) <= 59u)

#define IS_RTC_SECOND(x)                        ((x) <= 59u)

#define IS_RTC_WEEKDAY(x)                       ((x) <= 6u)

#define IS_RTC_ALARM_WEEKDAY(x)                 ((x) <= 0x7Fu)

#define IS_RTC_FLAG(x)                                                         \
(   (RTC_FLAG_PERIOD == (x))                    ||                             \
    (RTC_FLAG_ALARM == (x))                     ||                             \
    (RTC_FLAG_WAIT == (x)))

#define IS_RTC_INT_FLAG(x)                                                     \
(   (RTC_FLAG_PERIOD == (x))                    ||                             \
    (RTC_FLAG_ALARM == (x)))

