hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
#define IS_RTC_INTERRUPT(x)                                                    \
(   (RTC_INT_PERIOD == (x))                     ||                             \
    (RTC_INT_ALARM == (x)))

#define IS_RTC_COMPENSATION_VALUE(x)            ((x) <= 0x1FFu)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup RTC_Global_Functions RTC Global Functions
 * @{
 */

/**
 * @brief  De-Initialize RTC.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorTimeout: De-Initialize timeout
 */
en_result_t RTC_DeInit(void)
{
    uint32_t enRegSta;
    uint32_t u32Timeout, u32TimeCnt = 0ul;
    en_result_t enRet = Ok;

    bM0P_RTC->CR0_b.RESET = Reset;
    /* Waiting for normal count status or end of RTC software reset */
    u32Timeout = SystemCoreClock >> 8u;
    do
    {
        enRegSta = bM0P_RTC->CR0_b.RESET;
        u32TimeCnt++;
    } while ((u32TimeCnt < u32Timeout) && (Reset != enRegSta));

    if (Reset != enRegSta)
    {
        enRet = ErrorTimeout;
    }
    else
    {
        /* Reset all RTC registers */
        bM0P_RTC->CR0_b.RESET = Set;
    }

    return enRet;
}

/**
 * @brief  Initialize RTC.
 * @param  [in] pstcRtcInit             Pointer to a stc_rtc_init_t structure
 *                                      that contains configuration information.
 *   @arg  See the struct @ref stc_rtc_init_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_Init(const stc_rtc_init_t *pstcRtcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_CLOCK_SOURCE(pstcRtcInit->u8ClockSource));
        DDL_ASSERT(IS_RTC_HOUR_FORMAT(pstcRtcInit->u8HourFormat));
        DDL_ASSERT(IS_RTC_PERIOD_INTERRUPT(pstcRtcInit->u8PeriodInterrupt));

        /* RTC CR1 Configuration */
        MODIFY_REG(M0P_RTC->CR1, (RTC_CR1_PRDS | RTC_CR1_AMPM),
                   ((uint32_t)pstcRtcInit->u8PeriodInterrupt | pstcRtcInit->u8HourFormat));

        /* RTC CR3 Configuration */
        if (RTC_CLOCK_SOURCE_XTAL32 != pstcRtcInit->u8ClockSource)
        {
            MODIFY_REG(M0P_RTC->CR3, (RTC_CR3_LRCEN | RTC_CR3_RCKSEL),
                       ((uint32_t)pstcRtcInit->u8ClockSource | RTC_CR3_LRCEN));
        }
        else
        {
            MODIFY_REG(M0P_RTC->CR3, (RTC_CR3_LRCEN | RTC_CR3_RCKSEL),
                       (uint32_t)pstcRtcInit->u8ClockSource);
        }
    }

    return enRet;
}

/**
 * @brief  Fills each stc_rtc_init_t member with default value.
 * @param  [out] pstcRtcInit            Pointer to a stc_rtc_init_t structure
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_rtc_init_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_rtc_init_t member initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_StructInit(stc_rtc_init_t *pstcRtcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcRtcInit->u8ClockSource = RTC_CLOCK_SOURCE_XTAL32;
        pstcRtcInit->u8HourFormat = RTC_HOUR_FORMAT_12;
        pstcRtcInit->u8PeriodInterrupt = RTC_PERIOD_INT_INVALID;
    }

    return enRet;
}

/**
 * @brief  Enter RTC read/write mode.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Enter mode success
 *           - ErrorTimeout: Enter mode timeout
 */
en_result_t RTC_EnterRwMode(void)
{
    uint32_t enRegSta;
    uint32_t u32Timeout, u32TimeCnt = 0ul;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (Reset != bM0P_RTC->CR1_b.START)
    {
        bM0P_RTC->CR2_b.WAIT = Set;
        /* Waiting for WAITF bit set */
        u32Timeout = SystemCoreClock >> 8u;
        do
        {
            enRegSta = bM0P_RTC->CR2_b.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (Set != enRegSta));

        if (Set != enRegSta)
        {
            enRet = ErrorTimeout;
        }
    }

    return enRet;
}

/**
 * @brief  Exit RTC read/write mode.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Exit mode success
 *           - ErrorTimeout: Exit mode timeout
 */
en_result_t RTC_ExitRwMode(void)
{
    uint32_t enRegSta;
    uint32_t u32Timeout, u32TimeCnt = 0ul;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (Reset != bM0P_RTC->CR1_b.START)
    {
        bM0P_RTC->CR2_b.WAIT = Reset;
        /* Waiting for WAITF bit reset */
        u32Timeout = SystemCoreClock >> 8u;
        do
        {
            enRegSta = bM0P_RTC->CR2_b.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (Reset != enRegSta));

        if (Reset != enRegSta)
        {
            enRet = ErrorTimeout;
        }
    }

    return enRet;
}

/**
 * @brief  RTC period interrupt config.
 * @param  [in] u8IntCond               Specifies the period interrupt type.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_PERIOD_INT_INVALID:     Period interrupt invalid
 *   @arg  RTC_PERIOD_INT_HALF_SECOND: 0.5 second period interrupt
 *   @arg  RTC_PERIOD_INT_ONE_SECOND:  1 second period interrupt
 *   @arg  RTC_PERIOD_INT_ONE_MINUTE:  1 minute period interrupt
 *   @arg  RTC_PERIOD_INT_ONE_HOUR:    1 hour period interrupt
 *   @arg  RTC_PERIOD_INT_ONE_DAY:     1 day period interrupt
 *   @arg  RTC_PERIOD_INT_ONE_MONTH:   1 month period interrupt
 * @retval None
 */
void RTC_PeriodIntConfig(uint8_t u8IntCond)
{
    uint32_t enRtcSta, enIntSta;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_PERIOD_INTERRUPT(u8IntCond));

    enRtcSta = bM0P_RTC->CR1_b.START;
    enIntSta = bM0P_RTC->CR2_b.PRDIE;
    /* Disable period interrupt when START=1 and clear period flag after write */
    if ((Set == enIntSta) && (Set == enRtcSta))
    {
        bM0P_RTC->CR2_b.PRDIE = Reset;
    }

    /* RTC CR1 Configuration */
    MODIFY_REG(M0P_RTC->CR1, RTC_CR1_PRDS, (uint32_t)u8IntCond);

    if ((Set == enIntSta) && (Set == enRtcSta))
    {
        MODIFY_REG(M0P_RTC->CR2, RTC_CR2_PRDF, (uint32_t)RTC_CR2_PRDIE);
    }
}

/**
 * @brief  RTC enter low power condition check.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Can enter low power mode
 *           - ErrorTimeout: Can't enter low power mode
 */
en_result_t RTC_LowPowerCheck(void)
{
    uint32_t enRegSta;
    uint32_t u32Timeout, u32TimeCnt = 0ul;
    en_result_t enRet = Ok;

    /* Check RTC work status */
    if (Reset != bM0P_RTC->CR1_b.START)
    {
        bM0P_RTC->CR2_b.WAIT = Set;
        /* Waiting for RTC WAITF bit set */
        u32Timeout = SystemCoreClock >> 8u;
        do
        {
            enRegSta = bM0P_RTC->CR2_b.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (Set != enRegSta));

