hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
        if (Set != enRegSta)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            bM0P_RTC->CR2_b.WAIT = Reset;
            /* Waiting for RTC WAITF bit reset */
            u32TimeCnt = 0ul;
            do
            {
                enRegSta = bM0P_RTC->CR2_b.WAITF;
                u32TimeCnt++;
            } while ((u32TimeCnt < u32Timeout) && (Reset != enRegSta));

            if (Reset != enRegSta)
            {
                enRet = ErrorTimeout;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC clock compensation value.
 * @param  [in] u16CompenVal            Specifies the clock compensation value of RTC.
 *   @arg  This parameter can be any value between 0x00 and 0x1FF.
 * @retval None
 */
void RTC_SetClkCompenValue(uint16_t u16CompenVal)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_COMPENSATION_VALUE(u16CompenVal));

    bM0P_RTC->ERRCRH_b.COMP8 = ((uint32_t)u16CompenVal >> 8u) & 0x01u;
    WRITE_REG(M0P_RTC->ERRCRL, ((uint32_t)u16CompenVal & 0x00FFu));
}

/**
 * @brief  Set RTC current date.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [in] pstcRtcDate             Pointer to a stc_rtc_date_t structure
 *                                      that contains date configuration information.
 *   @arg  See the struct @ref stc_rtc_date_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set date success
 *           - Error: Set date failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDate)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        if (RTC_DATA_FORMAT_BCD == u8Format)
        {
            DDL_ASSERT(IS_RTC_YEAR(pstcRtcDate->u8Year));
            DDL_ASSERT(IS_RTC_MONTH(pstcRtcDate->u8Month));
            DDL_ASSERT(IS_RTC_DAY(pstcRtcDate->u8Day));
        }
        else
        {
            DDL_ASSERT(IS_RTC_YEAR(BCD2DEC(pstcRtcDate->u8Year)));
            DDL_ASSERT(IS_RTC_MONTH(BCD2DEC(pstcRtcDate->u8Month)));
            DDL_ASSERT(IS_RTC_DAY(BCD2DEC(pstcRtcDate->u8Day)));
        }
        DDL_ASSERT(IS_RTC_WEEKDAY(pstcRtcDate->u8Weekday));

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcDate->u8Year = DEC2BCD((uint32_t)pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = DEC2BCD((uint32_t)pstcRtcDate->u8Month);
                pstcRtcDate->u8Day = DEC2BCD((uint32_t)pstcRtcDate->u8Day);
            }
            WRITE_REG(M0P_RTC->YEAR, pstcRtcDate->u8Year);
            WRITE_REG(M0P_RTC->MON, pstcRtcDate->u8Month);
            WRITE_REG(M0P_RTC->DAY, pstcRtcDate->u8Day);
            WRITE_REG(M0P_RTC->WEEK, pstcRtcDate->u8Weekday);

            /* Exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Fills each stc_rtc_date_t member with default value.(Date = xx00 January 01 Monday).
 * @param  [out] pstcRtcDate            Pointer to a stc_rtc_date_t structure
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_rtc_date_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_rtc_date_t member Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_DateStructInit(stc_rtc_date_t *pstcRtcDate)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDate)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* xx00 January 01 Monday */
        pstcRtcDate->u8Year = 0u;
        pstcRtcDate->u8Month = RTC_MONTH_JANUARY;
        pstcRtcDate->u8Day = 1u;
        pstcRtcDate->u8Weekday = RTC_WEEKDAY_MONDAY;
    }

    return enRet;
}

/**
 * @brief  Get RTC current date.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [out] pstcRtcDate            Pointer to a stc_rtc_date_t structure
 *                                      will contain returned current date information.
 *   @arg  See the struct @ref stc_rtc_date_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Get date success
 *           - Error: Get date failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDate)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            /* Get RTC date registers */
            pstcRtcDate->u8Year = (uint8_t)READ_REG(M0P_RTC->YEAR);
            pstcRtcDate->u8Month = (uint8_t)READ_REG(M0P_RTC->MON);
            pstcRtcDate->u8Day = (uint8_t)READ_REG(M0P_RTC->DAY);
            pstcRtcDate->u8Weekday = (uint8_t)READ_REG(M0P_RTC->WEEK);

            /* Check decimal format*/
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcDate->u8Year = BCD2DEC(pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = BCD2DEC(pstcRtcDate->u8Month);
                pstcRtcDate->u8Day = BCD2DEC(pstcRtcDate->u8Day);
            }

