hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
            /* exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC current time.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [in] pstcRtcTime             Pointer to a stc_rtc_time_t structure
 *                                      that contains time configuration information.
 *   @arg  See the struct @ref stc_rtc_time_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set time success
 *           - Error: Set time failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetTime(uint8_t u8Format, stc_rtc_time_t *pstcRtcTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcTime)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
            {
                DDL_ASSERT(IS_RTC_HOUR12(pstcRtcTime->u8Hour));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcTime->u8AmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(pstcRtcTime->u8Hour));
            }
            DDL_ASSERT(IS_RTC_MINUTE(pstcRtcTime->u8Minute));
            DDL_ASSERT(IS_RTC_SECOND(pstcRtcTime->u8Second));
        }
        else
        {
            if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
            {
                DDL_ASSERT(IS_RTC_HOUR12(BCD2DEC(pstcRtcTime->u8Hour)));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcTime->u8AmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(BCD2DEC(pstcRtcTime->u8Hour)));
            }
            DDL_ASSERT(IS_RTC_MINUTE(BCD2DEC(pstcRtcTime->u8Minute)));
            DDL_ASSERT(IS_RTC_SECOND(BCD2DEC(pstcRtcTime->u8Second)));
        }

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcTime->u8Hour = DEC2BCD((uint32_t)pstcRtcTime->u8Hour);
                pstcRtcTime->u8Minute = DEC2BCD((uint32_t)pstcRtcTime->u8Minute);
                pstcRtcTime->u8Second = DEC2BCD((uint32_t)pstcRtcTime->u8Second);
            }
            if ((RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM) &&
                (RTC_HOUR12_PM == pstcRtcTime->u8AmPm))
            {
                WRITE_REG(M0P_RTC->HOUR, ((uint32_t)pstcRtcTime->u8Hour | RTC_HOUR12_PM));
            }
            else
            {
                WRITE_REG(M0P_RTC->HOUR, pstcRtcTime->u8Hour);
            }
            WRITE_REG(M0P_RTC->MIN, pstcRtcTime->u8Minute);
            WRITE_REG(M0P_RTC->SEC, pstcRtcTime->u8Second);

            /* Exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Fills each stc_rtc_time_t member with default value.(Time = Am: 06h:00m:00s).
 * @param  [out] pstcRtcTime            Pointer to a stc_rtc_time_t structure
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_rtc_time_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_rtc_time_t member Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_TimeStructInit(stc_rtc_time_t *pstcRtcTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcTime)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Am: 06h:00m:00s */
        pstcRtcTime->u8Hour = 6u;
        pstcRtcTime->u8Minute = 0u;
        pstcRtcTime->u8Second = 0u;
        pstcRtcTime->u8AmPm = RTC_HOUR12_AM;
    }

    return enRet;
}

/**
 * @brief  Get RTC current time.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [out] pstcRtcTime            Pointer to a stc_rtc_time_t structure
 *                                      will contain returned current time information.
 *   @arg  See the struct @ref stc_rtc_time_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Get time success
 *           - Error: Get time failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetTime(uint8_t u8Format, stc_rtc_time_t *pstcRtcTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcTime)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            /* Get RTC time registers */
            pstcRtcTime->u8Hour = (uint8_t)READ_REG(M0P_RTC->HOUR);
            pstcRtcTime->u8Minute = (uint8_t)READ_REG(M0P_RTC->MIN);
            pstcRtcTime->u8Second = (uint8_t)READ_REG(M0P_RTC->SEC);
            if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
            {
                if (RTC_HOUR12_PM == (pstcRtcTime->u8Hour & RTC_HOUR12_PM))
                {
                    pstcRtcTime->u8Hour &= (uint8_t)(~RTC_HOUR12_PM);
                    pstcRtcTime->u8AmPm = RTC_HOUR12_PM;
                }
                else
                {
                    pstcRtcTime->u8AmPm = RTC_HOUR12_AM;
                }
            }

            /* Check decimal format*/
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcTime->u8Hour = BCD2DEC(pstcRtcTime->u8Hour);
                pstcRtcTime->u8Minute = BCD2DEC(pstcRtcTime->u8Minute);
                pstcRtcTime->u8Second = BCD2DEC(pstcRtcTime->u8Second);
            }

