hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
            /* exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC alarm time.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [in] pstcRtcAlarm            Pointer to a stc_rtc_alarm_t structure
 *                                      that contains alarm time configuration information.
 *   @arg  See the struct @ref stc_rtc_alarm_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set RTC alarm time success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetAlarm(uint8_t u8Format, stc_rtc_alarm_t *pstcRtcAlarm)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarm)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
            {
                DDL_ASSERT(IS_RTC_HOUR12(pstcRtcAlarm->u8AlarmHour));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcAlarm->u8AlarmAmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(pstcRtcAlarm->u8AlarmHour));
            }
            DDL_ASSERT(IS_RTC_MINUTE(pstcRtcAlarm->u8AlarmMinute));
        }
        else
        {
            if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
            {
                DDL_ASSERT(IS_RTC_HOUR12(BCD2DEC(pstcRtcAlarm->u8AlarmHour)));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcAlarm->u8AlarmAmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(BCD2DEC(pstcRtcAlarm->u8AlarmHour)));
            }
            DDL_ASSERT(IS_RTC_MINUTE(BCD2DEC(pstcRtcAlarm->u8AlarmMinute)));
        }
        DDL_ASSERT(IS_RTC_ALARM_WEEKDAY(pstcRtcAlarm->u8AlarmWeekday));

        /* Configure alarm registers */
        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            pstcRtcAlarm->u8AlarmHour = DEC2BCD((uint32_t)pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = DEC2BCD((uint32_t)pstcRtcAlarm->u8AlarmMinute);
        }
        if ((RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM) &&
            (RTC_HOUR12_PM == pstcRtcAlarm->u8AlarmAmPm))
        {
            WRITE_REG(M0P_RTC->ALMHOUR, ((uint32_t)pstcRtcAlarm->u8AlarmHour | RTC_HOUR12_PM));
        }
        else
        {
            WRITE_REG(M0P_RTC->ALMHOUR, pstcRtcAlarm->u8AlarmHour);
        }
        WRITE_REG(M0P_RTC->ALMMIN, pstcRtcAlarm->u8AlarmMinute);
        WRITE_REG(M0P_RTC->ALMWEEK, pstcRtcAlarm->u8AlarmWeekday);
    }

    return enRet;
}

/**
 * @brief  Fills each stc_rtc_alarm_t member with default value.(Time = Am: 6h:00m Monday).
 * @param  [out] pstcRtcAlarm           Pointer to a stc_rtc_alarm_t structure
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_rtc_alarm_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_rtc_alarm_t member initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_AlarmStructInit(stc_rtc_alarm_t *pstcRtcAlarm)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarm)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Monday Am: 6h:00m */
        pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR12_AM;
        pstcRtcAlarm->u8AlarmHour = 6u;
        pstcRtcAlarm->u8AlarmMinute = 0u;
        pstcRtcAlarm->u8AlarmWeekday = RTC_ALARM_WEEKDAY_MONDAY;
    }

    return enRet;
}

/**
 * @brief  Get RTC alarm time.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_DATA_FORMAT_DEC: Decimal data format
 *   @arg  RTC_DATA_FORMAT_BCD: BCD data format
 * @param  [out] pstcRtcAlarm           Pointer to a stc_rtc_alarm_t structure
 *                                      will contain returned alarm time information.
 *   @arg  See the struct @ref stc_rtc_alarm_t.
 * @retval An en_result_t enumeration value:
 *           - Ok: Get RTC alarm time success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetAlarm(uint8_t u8Format, stc_rtc_alarm_t *pstcRtcAlarm)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarm)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        /* Get RTC date and time register */
        pstcRtcAlarm->u8AlarmWeekday = (uint8_t)READ_REG(M0P_RTC->ALMWEEK);
        pstcRtcAlarm->u8AlarmMinute = (uint8_t)READ_REG(M0P_RTC->ALMMIN);
        pstcRtcAlarm->u8AlarmHour = (uint8_t)READ_REG(M0P_RTC->ALMHOUR);
        if (RTC_HOUR_FORMAT_12 == bM0P_RTC->CR1_b.AMPM)
        {
            if (RTC_HOUR12_PM == (pstcRtcAlarm->u8AlarmHour & RTC_HOUR12_PM))
            {
                pstcRtcAlarm->u8AlarmHour &= (uint8_t)(~RTC_HOUR12_PM);
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR12_PM;
            }
            else
            {
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR12_AM;
            }
        }

        /* Check decimal format*/
        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            pstcRtcAlarm->u8AlarmHour = BCD2DEC(pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = BCD2DEC(pstcRtcAlarm->u8AlarmMinute);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable RTC alarm.
 * @param  [in] enNewSta                The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_AlarmCmd(en_functional_state_t enNewSta)
{
    uint32_t enRtcSta, enIntSta;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    enRtcSta = bM0P_RTC->CR1_b.START;
    enIntSta = bM0P_RTC->CR2_b.ALMIE;
    /* Disable alarm interrupt and clear alarm flag when START=1 and ALMIE=1 */
    if ((Set == enIntSta) && (Set == enRtcSta))
    {
        bM0P_RTC->CR2_b.ALMIE = Reset;
    }
    bM0P_RTC->CR2_b.ALME = enNewSta;

    if ((Set == enIntSta) && (Set == enRtcSta))
    {
        MODIFY_REG(M0P_RTC->CR2, RTC_CR2_ALMF, RTC_CR2_ALMIE);
    }
}

/**
 * @brief  Enable or disable specified RTC interrupt.
 * @param  [in] u8IntSource             Specifies the RTC interrupt source.
 *                                      This parameter can be one or a combination of the following values:
 *   @arg  RTC_INT_PERIOD: Period count interrupt
 *   @arg  RTC_INT_ALARM:  Alarm interrupt
 * @param  [in] enNewSta                The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_IntCmd(uint8_t u8IntSource, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_INTERRUPT(u8IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

