hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_rtc.c
    if (Disable != enNewSta)
    {
        SET_BIT(M0P_RTC->CR2, u8IntSource);
    }
    else
    {
        CLEAR_BIT(M0P_RTC->CR2, (uint32_t)u8IntSource);
    }
}

/**
 * @brief  Get RTC flag status.
 * @param  [in] u8Flag                  Specifies the RTC flag type.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_FLAG_PERIOD: Period count flag
 *   @arg  RTC_FLAG_ALARM:  Alarm flag
 *   @arg  RTC_FLAG_WAIT:   Wait flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t RTC_GetFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_FLAG(u8Flag));

    if (Reset != (READ_BIT(M0P_RTC->CR2, u8Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Clear RTC flag.
 * @param  [in] u8Flag                  Specifies the RTC flag type.
 *                                      This parameter can be one or a combination of the following values:
 *   @arg  RTC_FLAG_PERIOD: Period count flag
 *   @arg  RTC_FLAG_ALARM:  Alarm flag
 *   @arg  RTC_FLAG_WAIT:   Wait flag
 * @retval None
 */
void RTC_ClearFlag(uint8_t u8Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_FLAG(u8Flag));

    CLEAR_BIT(M0P_RTC->CR2, (uint32_t)u8Flag);
}

/**
 * @brief  Get RTC interrupt flag status.
 * @param  [in] u8IntFlag               Specifies the RTC interrupt flag type.
 *                                      This parameter can be one of the following values:
 *   @arg  RTC_FLAG_PERIOD: Period count flag
 *   @arg  RTC_FLAG_ALARM:  Alarm flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Interrupt flag is set
 *           - Reset: Interrupt flag is reset
 */
en_flag_status_t RTC_GetIntFlag(uint8_t u8IntFlag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_INT_FLAG(u8IntFlag));

    if (Reset != (READ_BIT(M0P_RTC->CR2, u8IntFlag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Clear RTC interrupt flag.
 * @param  [in] u8IntFlag               Specifies the RTC interrupt flag type.
 *                                      This parameter can be one or a combination of the following values:
 *   @arg  RTC_FLAG_PERIOD: Period count flag
 *   @arg  RTC_FLAG_ALARM:  Alarm flag
 * @retval None
 */
void RTC_ClearIntFlag(uint8_t u8IntFlag)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_INT_FLAG(u8IntFlag));

    CLEAR_BIT(M0P_RTC->CR2, (uint32_t)u8IntFlag);
}

/**
 * @}
 */

#endif /* DDL_RTC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
